import {
  Button,
  Checkbox,
  FormControl,
  FormControlLabel,
  Grid,
  IconButton,
  InputLabel,
  MenuItem,
  Modal,
  Paper,
  Select,
  Table,
  TableBody,
  TableCell,
  TableContainer,
  TableHead,
  TableRow,
  TextField,
  Typography,
} from '@mui/material';
import React, { useEffect, useState, useRef } from 'react';
import { useDispatch, useSelector } from 'react-redux';
import SideBar from '../Components/Dashboard/Sidebar/SideBar';
import {
  Container,
  ContentWrap,
  Header,
  ModalContainer,
  ModalContent,
  HeaderContainer,
  InnerConatiner,
} from '../Components/Global/GlobalStyle';
import {
  customerOrderList,
  getAllWarehouse,
  transferProductWarehouse,
  transferWithDraw,
} from '../Store/Customer/Actions/actionCreators';
import CloseIcon from '@mui/icons-material/Close';
import TransferWithinAStationIcon from '@mui/icons-material/TransferWithinAStation';
import UndoIcon from '@mui/icons-material/Undo';
import SignatureCanvas from 'react-signature-canvas';
import { useTranslation } from 'react-i18next';

const OrderList = () => {
  const { t } = useTranslation();
  const dispatch = useDispatch();
  const orderList = useSelector((state) => state.customer.orderList);
  const customer = useSelector((state) => state.customer.customer);
  const signSignature = useRef();
  const [transferModal, setTransferModal] = useState(false);
  const [transferWarehouse, setTransferWarehouse] = useState({
    order_id: '',
    transfer_date_time: {
      date: '',
      time: '',
    },
  });

  const [withdrawModal, setWithdrawModal] = useState(false);
  const [withdrawWarehouse, setWithdrawWarehouse] = useState({
    order_id: '',
    withdraw_date_time: {
      date: '',
      time: '',
    },
    quantity: '',
    tempQuantity: 0,
  });

  const formatDateAndTimeString = (date) => {
    var dd = (date.getDate() < 10 ? '0' : '') + date.getDate();

    var MM = (date.getMonth() + 1 < 10 ? '0' : '') + (date.getMonth() + 1);

    return `${date.getFullYear()}-${MM}-${dd} ${
      (date.getHours() < 10 ? '0' : '') + date.getHours()
    }:${(date.getMinutes() < 10 ? '0' : '') + date.getMinutes()}:${
      (date.getSeconds() < 10 ? '0' : '') + date.getSeconds()
    }`;
  };

  const [isAccept, setIsAccept] = useState(false);

  useEffect(() => {
    if (customer.id) {
      dispatch(customerOrderList(customer.id));
    }
    dispatch(getAllWarehouse());
  }, [customer]);
  const [opentearmentModal, setOpenTearmentModal] = useState(false);
  function convertCanvasToImage(url) {
    let image = new Image();
    image.src = url;
    return image.src.replace('data:image/png;base64,', '');
  }
  return (
    <Container>
      <Modal open={transferModal}>
        <ModalContainer>
          <ModalContent>
            <HeaderContainer>
              <Header>{t('transfer')}</Header>
              <IconButton onClick={() => setTransferModal(false)}>
                <CloseIcon />
              </IconButton>
            </HeaderContainer>
            <Grid container spacing={2}>
              <Grid item xs={12}>
                <TextField
                  type='date'
                  fullWidth
                  variant='outlined'
                  label={t('date')}
                  value={transferWarehouse.transfer_date_time.date}
                  onChange={(e) =>
                    setTransferWarehouse({
                      ...transferWarehouse,
                      transfer_date_time: {
                        ...transferWarehouse.transfer_date_time,
                        date: e.target.value,
                      },
                    })
                  }
                />
              </Grid>
              <Grid item xs={12}>
                <TextField
                  fullWidth
                  variant='outlined'
                  label={t('time')}
                  type='time'
                  value={transferWarehouse.transfer_date_time.time}
                  onChange={(e) =>
                    setTransferWarehouse({
                      ...transferWarehouse,
                      transfer_date_time: {
                        ...transferWarehouse.transfer_date_time,
                        time: e.target.value,
                      },
                    })
                  }
                />
              </Grid>
              <Grid item xs={12}>
                <Button
                  onClick={() => {
                    dispatch(
                      transferProductWarehouse(
                        {
                          ...transferWarehouse,
                          transfer_date_time:
                            transferWarehouse.transfer_date_time.date +
                            ' ' +
                            transferWarehouse.transfer_date_time.time,
                        },
                        customer.id,
                        setTransferModal
                      )
                    );
                  }}
                  variant='contained'
                >
                  {t('transfer')}
                </Button>
              </Grid>
            </Grid>
          </ModalContent>
        </ModalContainer>
      </Modal>
      <Modal open={withdrawModal}>
        <ModalContainer>
          <ModalContent width='30%'>
            <HeaderContainer>
              <Header>{t('Withdrawalrequest')}</Header>
              <IconButton onClick={() => setWithdrawModal(false)}>
                <CloseIcon />
              </IconButton>
            </HeaderContainer>
            <Grid container spacing={2}>
              <Grid item xs={12}>
                <TextField
                  type='date'
                  fullWidth
                  variant='outlined'
                  label={t('date')}
                  value={withdrawWarehouse.withdraw_date_time.date}
                  onChange={(e) =>
                    setWithdrawWarehouse({
                      ...withdrawWarehouse,
                      withdraw_date_time: {
                        ...withdrawWarehouse.withdraw_date_time,
                        date: e.target.value,
                      },
                    })
                  }
                />
              </Grid>
              <Grid item xs={12}>
                <TextField
                  fullWidth
                  variant='outlined'
                  label={t('time')}
                  type='time'
                  value={withdrawWarehouse.withdraw_date_time.time}
                  onChange={(e) =>
                    setWithdrawWarehouse({
                      ...withdrawWarehouse,
                      withdraw_date_time: {
                        ...withdrawWarehouse.withdraw_date_time,
                        time: e.target.value,
                      },
                    })
                  }
                />
              </Grid>
              <Grid item xs={12}>
                <FormControl fullWidth>
                  <InputLabel htmlFor='quantity'>{t('quantity')}</InputLabel>
                  <Select
                    id='quantity'
                    onChange={(e) => {
                      setWithdrawWarehouse({
                        ...withdrawWarehouse,
                        quantity: e.target.value,
                      });
                    }}
                  >
                    {withdrawWarehouse.tempQuantity > 0 &&
                      Array(withdrawWarehouse.tempQuantity)
                        .fill()
                        .map((_, index) => (
                          <MenuItem key={index} value={index + 1}>
                            {index + 1}
                          </MenuItem>
                        ))}
                  </Select>
                </FormControl>
              </Grid>
              <Grid item xs={12}>
                <Typography variant='h6'>{t('signature')}</Typography>
                <SignatureCanvas
                  ref={signSignature}
                  penColor='black'
                  canvasProps={{
                    width: 500,
                    height: 200,
                    className: 'sigCanvas',
                  }}
                />
              </Grid>
              <Grid item xs={12}>
                <FormControlLabel
                  control={
                    <Checkbox
                      value={isAccept}
                      onChange={(e) => setIsAccept(e.target.checked)}
                    />
                  }
                  label={t('termsconditions')}
                />
              </Grid>
              <Grid item xs={12}>
                <Button
                  disabled={
                    (signSignature.current !== undefined &&
                      signSignature.current?.isEmpty()) ||
                    !isAccept
                  }
                  onClick={() => {
                    setOpenTearmentModal(true);
                  }}
                  variant='contained'
                >
                  {t('withdrawal')}
                </Button>
              </Grid>
            </Grid>
          </ModalContent>
        </ModalContainer>
      </Modal>
      <Modal open={opentearmentModal}>
        <ModalContainer>
          <ModalContent width='30%'>
            <HeaderContainer>
              <Header>{t('termsconditions')}</Header>
              <IconButton onClick={() => setOpenTearmentModal(false)}>
                <CloseIcon />
              </IconButton>
            </HeaderContainer>
            <Grid container spacing={2}>
              <Grid
                sx={{
                  Height: '50vh',
                }}
                item
                xs={12}
              >
                <p>
                  شروط وأحكام النقل عند طلب خدمات SLD EXPRESS ، فإنك ، بصفتك
                  "صاحب الشحنة" ، توافق ، نیابة عنك ونیابة عن مستلم الشحنة
                  ("المستلم") وأي شخص آخر لدیه مصلحة في الشحنة التي تنطبق علیها
                  هذه الشروط والأحكام. "الشحنة" تعني جمیع المستندات أو الطرود
                  التي تنتقل بموجب بولیصة شحن واحدة، والتي یمكن إجراؤها بأي
                  وسیلة تختارها SLD EXPRESS بما في ذلك الجو أو البر أو أي شركة
                  نقل أخرى. یجب أن تشتمل "بولیصة الشحن" على أي معرف أو مستند خاص
                  بالشحنة یتم اصداره بواسطة أنظمة SLD EXPRESS أو ناقل الشحنة
                  الأوتوماتیكیة ، مثل الملصق أو الرمز الشریطي أو بولیصة الشحن أو
                  مذكرة الشحن بالإضافة إلى أي نسخة إلكترونیة منه.یتم نقل كل شحنة
                  على أساس مسؤولیة محدودة على النحو المنصوص علیه هنا. إذا كان
                  الشاحن یحتاج إلى حمایة أكبر ، فقد یتم ترتیب التأمین بتكلفة
                  إضافیة. (یرجى الاطلاع أدناه للحصول على مزید من المعلومات).
                  "SLD EXPRESS" تعني أي عضو في شبكة SLD EXPRESS إكسبریس. 1-
                  التخلیص الجمركي قد تقوم SLD EXPRESS بأي من الأنشطة التالیة
                  نیابة عن صاحب الشحنة أو المستلم لتقدیم خدماتها: أكمال أي
                  مستندات ، وتعدیل رموز المنتج أو الخدمة ، ودفع أي رسوم أو ضرائب
                  أو عقوبات مطلوبة بموجب القوانین واللوائح المعمول بها ("الرسوم
                  الجمركیة"). القیام بدور وكیل الشحن لدى الشاحن لأغراض الجمارك
                  ومراقبة الصادرات وكمستقبل فقط لغرض تعیین وسیط جمركي لأداء
                  التخلیص الجمركي والدخول. إعادة توجیه الشحنة إلى وسیط الجمارك
                  لدى المستلم أو عنوان آخر عند الطلب من قبل أي شخص تعتقد SLD
                  EXPRESS في بأنه مخول. 2- شحنات غیر مقبولة تعتبر الشحنة غیر
                  مقبولة إذا: لم یتم إصدار إقرار جمركي عند اللوائح الجمركیة
                  الساریة. أنها تحتوي على السلع المقلدة ، والحیوانات ، والسبائك
                  ، والعملة ، والأحجار الكریمة. الأسلحة والمتفجرات والذخیرة ؛
                  بقایا بشریة، العناصر غیر القانونیة مثل العاج والمخدرات. تصنف
                  على أنها مواد خطرة أو بضائع خطرة أو مقالات محظورة أو مقیدة من
                  قبل IATA) الرابطة الدولیة للنقل الجوي) أو ICAO) منظمة الطیران
                  المدني الدولي) أو ADR) اللائحة الأوروبیة للنقل البري على
                  البضائع الخطرة) أو أي منظمة أخرى ذات صلة ("بضاعة خطیرة").
                  عنوانه غیر صحیح أو غیر محدد بشكل صحیح أو عبواته معیبة أو غیر
                  كافیة لضمان النقل الآمن مع العنایة العادیة ، 5 .أنه یحتوي على
                  أي عنصر آخر یقرر SLD EXPRESS أنه لا یمكن حمله بشكل آمن أو بشكل
                  قانوني. 3- التسلیم والعناصر غیر القابلة للتسلیم: لا یمكن تسلیم
                  الشحنات إلى صنادیق البرید أو الرموز البریدیة. یتم تسلیم
                  الشحنات إلى عنوان المتلقي الذي قدمه صاحب الشحنة ولكن لیس
                  بالضرورة إلى المتلقي المسمى شخصیًا. سیتم تسلیم الشحنات إلى
                  العناوین التي تحتوي على منطقة استقبال مركزیة إلى تلك المنطقة.
                  قد تقوم SLD EXPRESS بإخطار المتلقي بالتسلیم القادم أو التسلیم
                  الفائت. قد یتم تقدیم خیارات بدیلة للتوصیل مثل التسلیم في یوم
                  آخر ، لا یتطلب التوقیع ، أو إعادة التوجیه أو التجمیع في مركز
                  خدمة SLD EXPRESS. قد یستثني صاحب الشحنة بعض خیارات التسلیم عند
                  الطلب. إذا اعتبرت الشحنة غیر مقبولة على النحو الموصوف في القسم
                  2 ، أو إذا كان قد تم تقییمها بأقل من قیمتها لأغراض جمركیة ، أو
                  لا یمكن تحدید هویة المتلقي أو تحدید موقعه بشكل معقول ، أو یرفض
                  المتلقي التسلیم أو دفع ً الرسوم الجمركیة أو رسوم الشحن الأخرى
                  ، یتعین على SLD EXPRESS بذل جهودا معقولة لإعادة الشحنة إلى
                  الشاحن على نفقته ، إذا لم یتم إصدار الشحنة یتم التصرف فیها أو
                  بیعها دون تكبد أي مسؤولیة من أي نوع كانت تجاه الشاحن أو أي شخص
                  آخر ، مع تطبیق العائدات على الرسوم الجمركیة ورسوم الشحن
                  والتكالیف الإداریة ذات الصلة مع رصید عائدات البیع المراد
                  إرجاعها إلى الشاحن. تتمتع شركة SLD EXPRESS بالحق في تدمیر أي
                  شحنة یمنع أي قانون شركة SLD EXPRESS من العودة إلى الشاحن وأي
                  شحنة من البضائع الخطرة. تسلیم الشحنة تقوم شركة SLD EXPRESS
                  بتسلیم جمیع الشحنات إلى عنوان المرسل إلیه ، والمسجلة في عقد
                  الخدمة ، وتكون مسؤولة عن أي خسارة أو تأخیر أو تسلیم ناتج عن
                  ذلك. یتم تسلیم الشحنة إلى المرسل إلیه أو الممثل المفوض مع
                  تطبیق إجراءات مقیدة للتحقق من هویة المستلم قبل التسلیم. یتعین
                  على SLD EXPRESS إعادة أي شحنة یتم تسلیمها بشكل خاطئ. في حالة
                  فشل تسلیم الشحنة بسبب رفض المرسل إلیه استلامها أو لأي سبب آخر
                  من قبل المستفید ، یجب على SLD EXPRESS تطبیق القواعد والإجراءات
                  للتعامل مع العناصر غیر القابلة للتسلیم المعلنة في برامجها
                  ومراكز الخدمة ، بشرط أن تكون هذه القواعد أن تأخذ في الاعتبار
                  عدد المحاولات التي یجب إجراؤها للإیصال. وهذه القواعد
                  والإجراءات تمتثل للقواعد الدولیة في هذا الصدد حیث تقوم SLD
                  EXPRESS بتسجیل والاحتفاظ بإجراءات التعامل مع المواد البریدیة
                  التي لا یمكن تسلیمها في سجل خاص موثق تم إنشاؤه لهذا الغرض ،
                  لفترة لا تقل عن سنة تقویمیة واحدة من تاریخ الإجراء المتخذ. 4-
                  اعادة الشحن وتعدیل العنوان قد یطلب الشاحن إعادة الشحنة أو
                  تعدیل عنوان المرسل إلیه ، قبل تسلیمه إلى المرسل إلیه. بالإضافة
                  إلى ذلك ، قد یتم فرض رسوم إضافیة على المستفید حسب الاقتضاء
                  إجراءات العناصر الغیر قابلة للتسلیم: ً یمكن أن تكون الشحنة غیر
                  القابلة للتسلیم إما بناء على تعلیمات العمیل أو الحصول على
                  موافقة من الطرفین إذا كانت الشحنة محتجزة بعد فترة معقولة أو
                  محاولات التسلیم. یمكن أن یكون سبب الشحن غیر المرغوب فیه
                  للأسباب التالیة ، ولكن لیس على سبیل الحصر. طلب الشاحن عنصر غیر
                  قابل للتسلیم. المرسل إلیه یرفض قبول الشحنة. المرسل إلیه یرفض
                  دفع الرسوم المطبقة على الشحنة مقابل الرسوم والضرائب والشحن عند
                  التسلیم والنقود عند التسلیم ورسوم العمل ورسوم المناولة
                  الإضافیة وما إلى ذلك. ولا یمكن للشاحن المساعدة في الحصول على
                  عنوان التسلیم الصحیح. المرسل إلیه یرفض تقدیم المستندات
                  المطلوبة من قبل سلطات الجمارك للوجهة ، لتسهیل التخلیص من
                  الشحن. تنطبق الرسوم غیر القابلة للتسلیم على النحو المتفق علیه
                  في مصفوفة الأسعار إذا تم إعادة توجیه الشحنات إلى عنوان جدید ،
                  فلا یوافق الشاحن على دفع رسوم إعادة التوجیه. تحتفظ شركة SLD
                  EXPRESS بحقها في مطالبة المرسل إلیه بدفع هذه الرسوم في الحالات
                  التي تتطلب إعادة التوجیه إلى مدن مختلفة عن مدینة الوجهة الأولى
                  الشحنات المرتجعة: تخضع شروط الشحن المرتجع للاتفاقیات والأحكام
                  بین الشاحن والمستلم ولا تمثل SLD EXPRESS أي طرف في هذه الشروط.
                  حیث تلتزم SLD EXPRESS بإجراءات الشحن فقط. 5- البضائع الممنوعة
                  من الاستیراد: الخنازیر ولحومها ودهونها وشعرها ودمها ومخلفاتها
                  ، وكل ما یتم استخراجه منها. الكلاب ؛ باستثناء كلاب الصید أو
                  الحراسة أو الكلاب لتوجیه المكفوفین مع شهادات من السلطات
                  المختصة في البلد المصدر مصدقة من السفارة السعودیة تشیر إلى أن
                  الكلب المراد دخوله هو كلب لحراسة أو صید أو لتوجیه المكفوفین.
                  بالإضافة إلى ذلك ، یجب تقدیمه إلى الحجر البیطري. لحم الضفدع.
                  العقاقیر المخدرة بجمیع أنواعها وأشكالها وأسماءها بالإضافة إلى
                  الجوز السناقي والكمباكي (كولا أكومات) "غورو. جمیع المواد
                  الغذائیة المصنوعة من دم الحیوان. النبیذ والمواد المسكرة من
                  جمیع الأنواع بما في ذلك ما یحتوي على المواد الكحولیة في أي
                  نسبة التسمم ، وكذلك أجهزة لتقطیر النبیذ والمواد التي لا تستخدم
                  إلا في التقطیر. فواتیر فارغة موجهة باسم الشركات الأجنبیة في
                  الخارج. مواد الدعایة للسجائر بجمیع أنواعها. الصلیب أو أي سلعة
                  تحتوي على صور أو نقوش أو رسومات أو تلاوات أو عبارات بما في ذلك
                  الكتب والنشرات والمنشورات الأخرى والأفلام والأشرطة المخالفة
                  للعقیدة الإسلامیة والأخلاق أو لوائح المنشورات. التعبئة الفارغة
                  تأتي من الخارج لإعادة تعبئتها محلیا مع إشارة المنشأ الملصقة
                  علیها. الدمى التي لا تتوافق مع أحكام الشریعة والأخلاق العامة
                  والمستوردة للبیع بكمیات تجاریة. الأدوات والآلات والأجهزة للعب
                  القمار بجمیع أنواعه. الإطارات المستعملة والمجددة. أشجار عید
                  المیلاد. الأسلحة والمعدات العسكریة بكافة أنواعها وأجزائها
                  وذخائرها باستثناء تلك الخاصة بالقطاعات الحكومیة المختصة.
                  مناظیر للرؤیة اللیلیة ، كامیرات للرؤیة اللیلیة مجهریة ومشاهد
                  تلسكوبیة للتركیب على الأسلحة. المواد المتفجرة والمشعة ،
                  المفرقعات الناریة ، ملح البارود بجمیع أنواعه وكلورات
                  البوتاسیوم إلا بتصریح رسمي. الألعاب الناریة من جمیع الأنواع.
                  الأدویة التي لا تحمل ملصق أو مرفقة بكتیب یوضح تركیبها وكمیتها
                  لكل مكون طبقًا للوائح لممارسة مهنة الصیدلة وتجارة الأدویة
                  والمستحضرات الطبیة. البضائع المرسومة علیها شعار الحكومة على
                  هیئة سیوفین متقاطعین مع شجرة نخیل ذات ساق طویل وأوراق في
                  الفراغ أعلاه وبین الشفرات ممثلة بشكل صحیح. جوزة الطیب الفاكهة.
                  بذور ومسحوق منه. یقتصر الإذن باستیراده على البودرة المخلوطة مع
                  البهارات الأخرى ضمن حدود النسبة المسموح بها والتي لا تتجاوز
                  20.٪. سندات وكوبونات لحیوانات الأضحیة (الأضحیة والهدي) ، فدیة
                  (الفدیة) والإحسان (صدقة). الكامیرات التي تجرد الجسم من
                  الفساتین في صورة عاریة. أجهزة تدلیك مقدمة بطریقة تنتهك
                  الأخلاق. السیارات الصغیرة والدراجات الناریة للأطفال التي لا
                  یتجاوز ارتفاعها عن محور العجلة 50 سم ، ومجهزة بالبنزین أو
                  الغاز أو أي محرك یعمل بالمواد القابلة للاشتعال وكذلك تعمل
                  بالبطاریة إذا تجاوزت سرعتها 10 كم / ساعة. أجهزة فتح الاقفال
                  المستخدمة في فتح الأبواب والسیارات. الأبواق المزعجة. أقنعة
                  تمویه. أكیاس فارغة یتم استیرادها بشكل منفصل تحمل علامات أو
                  بیانات حول المواد الغذائیة أو الأسمنت أو العلامات التجاریة
                  لشركاتها.بإستثناء ما یتم استیراده للشركات المحلیة. عباءات
                  المرأة الشفافة حتى لو كانت للاستخدام الشخصي. أشكال خاصة من
                  السكاكین مصممة لأغراض عدوانیة مثل كونها مزودة بشفرتین أو
                  بمقبض. أجهزة الترفیه ، التي تحتوي على الضحك الهستیري. كربونات
                  الصودیوم (رماد الصودا). أقلام في شكل حقنة. البضائع التي تحمل
                  أعلام الدول الأجنبیة بشكل بارز كبیر. الاشیاء المصممة التي تسبب
                  تهیج أعضاء الجسم. عینة من ختم النبي محمد (صلى االله علیه
                  وسلم). جلود الحیوانات البریة. أجهزة إرسال الفیدیو اللاسلكي
                  (الفیدیو الداعم). حقائب تحتوي على أجهزة رادیو ومسجل كاسیت
                  وأجهزة إنذار. بطاقات المعایدة التي تحتوي على جهاز موسیقي صغیر
                  یتم تشغیله تلقائیًا عند تحریك البطاقة. هوائیات مركبات مماثلة
                  لهوائیات سیارات الشرطة وأجهزة التلفزیون اللاسلكیة. النقود
                  المزیفة. برومات البوتاسیوم ، والذي یستخدم كعامل ناضج في خبز
                  الخبز. المركبات ذات اثنین من أنابیب العادم ، 450 حصان وناقل
                  حركة عادي. أجهزة مثبتة خلف السائق لتنبیهه في حالة نومه. شعار
                  النسر. الأجهزة التي تغیر الصوت. نظارات اللیزر مع الثقوب.
                  الأحذیة المضیئة التي یستخدم فیها الزئبق. الألعاب في شكل ید
                  الإنسان ، والتي تظهر بعض السائقین بشكل بارز في سیاراتهم. محراب
                  الكتروني. نموذج. الكعبة المشرفه. نجمة خماسیة. الصحف القدیمة.
                  المركبات ذات المقود على الجانب الأیمن. البنادق العتیقة. أقلام
                  اللیزر. 6- البضائع التي علیها قیود عند الاستیراد تخضع المواد
                  التالیة للفحص من قبل الحجر الزراعي والبیطري في وزارة الزراعة
                  والمیاه وفقًا لقرار مجلس الوزراء :17/10/1989 تاریخ 50 رقم (أ)
                  المنتجات الحیوانیة / الشحنات: الحیوانات الحیة الصالحة للأكل من
                  جمیع الأنواع. الحیوانات الحیة المفترسة البریة. طیور الزینة
                  بأنواعها. الدواجن الحیة والأرانب والدجاج من جمیع الأنواع.
                  أسماك الزینة بجمیع أنواعها. بیض للتفقیس. السائل المنوي.
                  اللقاحات البیطریة. الأدویة البیطریة (یتم إصدار الأدویة
                  البیطریة من قبل اللجنة المختصة المشكلة لهذا الغرض من قبل وزارة
                  الصحة بموجب المرسوم الملكي رقم م / 18 بتاریخ 1978/02/26 وقواعد
                  تنفیذه. ممثل الوزارة الزراعة والمیاه تشارك في عضویة هذه
                  اللجنة. مركزات الأعلاف والفیتامینات والأملاح المعدنیة منها.
                  یجب أن یشمل التحلیل والفحص الهرمونات إن وجدت. الجلود الكبیرة
                  والصغیرة والشعر وجلود الفراء والصوف من أصل حیواني لا یخضع لأي
                  معالجة. (ب) الشحنات الزراعیة. طرود النخیل. الشتلات. نباتات
                  الزینة. الفواكه الطازجة والخضروات والتمر والمواد القابلة
                  للتلف. البذور. الحبوب والمواد المستخدمة كعلف للحیوانات مثل
                  الشعیر والذرة والدخن وفول الصویا والقش وعشب رودس وكعكة الزیت
                  بأنواعها. الأسمدة العضویة وطحلب الخث. جمیع المبیدات الزراعیة
                  والأسمدة الكیماویة ؛ الجافة والسائلة. یتم إصدار جمیع المنتجات
                  الأخرى من قبل وزارة التجارة الممثلة في مختبرات مراقبة الجودة
                  مثل المواد الغذائیة (اللحوم ، الأسماك ، الأغذیة المعلبة ،
                  الحدید ، الألومنیوم ، إلخ). جمیع الحیوانات البریة إلا بموافقة
                  الهیئة السعودیة للحیاة الفطریة حسب الخطاب الذي یحدد أنواعها
                  وأعدادها وفصائلها. یجب ان یحمل بیض الطعام ختم الدولة المنتجة.
                  ولكن ، البیض المستورد للتفقیس ، یجب تقدیم شهادة من الحجر الصحي
                  الزراعي تفید بأنها مستوردة للتفقیس. القمح والدقیق إلا من خلال
                  منظمة صوامع الغلال ومطاحن الدقیق. یجب مراعاة الشروط المتعلقة
                  بالتبغ ومصنوعاته (مثل الحاجة إلى الامتثال للمواصفات وعبارات
                  التحذیر ونسبة القطران وتاریخ التصنیع وضرورة عرض صور التحذیر
                  على علب السجائر). لا یجوز بیع أي نوع من الأدویة أو المستحضرات
                  الطبیة للتداول أو. للمستشفیات إلا لمن یحمل رخصة من الهیئة
                  السعودیة للغذاء والدواء (SFDA .( ِ یتطلب الإصدار إصدار شهادة
                  مستقلة أو ملاحظة على الفواتیر من قبل الهیئة العامة للغذاء
                  والدواء (SFDA (مع الإشارة صراحة إلى أن المنتجات تفي بالشروط
                  المناسبة. یتطلب إعفاء الكحول والنظائر المشعة من الرسوم
                  الجمركیة المنصوص علیها في الفصول (22 ، 28 (إنتاج شهادة من
                  الهیئة العامة للغذاء والدواء تثبت أنها مخصصة للأغراض الطبیة.
                  یتطلب إعفاء الأدویة المنصوص علیها في الفصل (30 (من الرسوم
                  الجمركیة إدراج المنتج في البند والملاحظات التوضیحیة منه والفصل
                  (ب). لا یجوز بیع المواد الكیمیائیة بجمیع أنواعها بما في ذلك
                  المتفجرات والألعاب الناریة وملح البارود بجمیع أنواعه وكلورات
                  البوتاسیوم إلا بعد الحصول على إذن مسبق من السلطة المختصة.
                  تستثنى الواردات باسم الجهات الحكومیة المختصة. جمیع المطبوعات
                  المستوردة سواء المقروءة أو المسموعة أو المرئیة أو المكتوبة بخط
                  الید لا یجوز عرضها عنهم إلا بموافقة وزارة الإعلام. یتم استیراد
                  البرید غیر المستخدم من العدد الحالي في المملكة من قبل الجهة
                  الحكومیة المختصة. لاستیراد الملابس البالیة ، یجب أن تكون
                  مصحوبة بشهادة تطهیر من الخارج. خلاف ذلك ، یجب تقدیمه إلى الحجر
                  الصحي. لا یجوز إطلاق أجهزة التقطیر إلا بموافقة وزارة الصحة أو
                  أي من فروعها فیما یتعلق بالأغراض الطبیة والعلمیة. ولكن یتم
                  إصدار تلك المتعلقة بشركات الصیانة والخدمات الفنیة والمقاولات
                  العامة من قبل وزارة التجارة والاستثمار. الأجهزة الكهربائیة
                  المبینة في القوائم المبلغة للجمارك وكذلك لا یجوز إصدار البضائع
                  التي یتطلب إصدارها مطابقتها للمواصفات القیاسیة إلا بعد تقدیم
                  هذه الشهادة للسلع المستوردة لأغراض التداول. الأجهزة اللاسلكیة
                  من جمیع الأنواع ، أیا كان مداها ، یجب أن تتطلب تصریح مسبق
                  باستثناء تلك المستوردة ً لرسالة من الوزیر المختص تحدد أنواعها
                  وكمیاتها والغرض من للوكالات الحكومیة والشركات ؛ یفرج عنهم وفقا
                  استیرادها. أسلحة الصید والأسلحة البیضاء والأسلحة الناریة
                  المخصصة لإطلاق الذخیرة الحیة مثل أ. مسدسات الإشارات والأسلحة
                  الأخرى مثل البنادق الهوائیة أو الغازیة أو المسدسات النابضة أو
                  غیرها ، وكذلك الألعاب الناریة من جمیع الأنواع ، وبنادق لعبة
                  لتدریب الأولاد على إطلاق النار المستهدف والمسدسات مع ضوضاء
                  مزعجة وأنواع مماثلة تستخدم في الصید والاستثمار والریاضة
                  والأغراض الترفیهیة تتطلب موافقة مسبقة من السلطات المختصة.
                  الرتب العسكریة والملابس والشارات إلا بموافقة الجهات المختصة.
                  المركبات التي تحمل لوحات أو نقوش تشیر إلى أنها تخص وكالة أمنیة
                  عسكریة ، إلا بموافقة من السلطات المختصة. قطع غیار السیارات
                  المستعملة. الملابس المستعملة. أجهزة الكشف عن الذهب والمجوهرات
                  وما شابهها ، إلا بموافقة الجهات المختصة. 28 .أجهزة الكشف عن
                  العملة المزیفة إلا بموافقة الجهات المختصة. لافتات بلاستیكیة
                  تشبه إشارات المرور المثبتة على المركبات ، إلا بموافقة من
                  الجهات المختصة. حریق مسحوق إطفاء الحریق وأجهزة إنذار الحریق.
                  أجهزة السلامة. آلات معالجة البرید. التحف. الخیول. زخرفة
                  المركبات تشبه الرتب العسكریة. كلیشیهات مستوردة للشركات
                  والمؤسسات الوطنیة. الطائرات التي تدیرها جهاز التحكم عن بعد.
                  قوارب الصید. آلات وأدوات لتصنیع وإصلاح ونسخ المفاتیح ،
                  باستثناء بترخیص من الأمن العام. المواد المستنفدة للأوزون
                  (رئاسة الأرصاد والبیئة). الحیوانات المهددة بالانقراض (الهیئة
                  السعودیة للحیاة البریة). بطاقات استقبال التلفزیون (وزارة
                  الإعلام). اسطوانات الغاز (تقدم إلى الهیئة السعودیة للمواصفات
                  والمقاییس والجودة). 7- التفتیش یحق لـ SLD EXPRESS فتح شحنة
                  وتفتیشها دون إشعار مسبق للسلامة أو الأمن أو الجمارك أو لأسباب
                  تنظیمیة أخرى. 8- رسوم الشحن ِ ا للوزن الفعلي أو الحجمي لكل
                  قطعة ویمكن إعادة وزنها وإعادة قیاسها من قبل SLD EXPRESS یتم
                  احتساب رسوم شحن SLD EXPRESS وفقً لتأكید هذا الحساب. على الشاحن
                  أو المتلقي عندما یتصرف SLD EXPRESS نیابة عن المتلقي أن یدفع أو
                  یسدد SLD EXPRESS مقابل كل شحنة أو رسوم أخرى مستحقة ، أو الرسوم
                  الجمركیة المستحقة عن الخدمات التي تقدمها SLD EXPRESS أو التي
                  تكبدتها SLD EXPRESS نیابة عن الشاحن أو المتلقي. قد یتم طلب دفع
                  الرسوم الجمركیة قبل التسلیم. إذا استخدمت SLD EXPRESS ائتمانها
                  لدى السلطات الجمركیة أو دفعت أي رسوم جمركیة نیابة عن مستلم لیس
                  لدیه حساب لدى SLD EXPRESS ، یحق لـ SLD EXPRESS تقییم الرسوم.
                  9- التزامات SLD EXPRESS 1 .إن مسؤولیة SLD EXPRESS فیما یتعلق
                  بأي شحنة یتم نقلها عن طریق الجو (بما في ذلك النقل البري
                  الإضافي أو التوقف في الطریق) تقتصر بموجب اتفاقیة مونتریال أو
                  اتفاقیة وارسو كما هو معمول به ، أو في حالة عدم وجود هذه
                  الاتفاقیة ، على (1 (السوق الحالیة أو القیمة المعلنة ، أو (2
                  (19 حقوق سحب خاصة لكل كیلوغرام (حوالي 00.26 ً دولارا أمریكیً ً
                  ا للكیلوغرام الواحد). تنطبق هذه الحدود أیضا على جمیع أشكال
                  النقل الأخرى ، باستثناء الحالات التي یتم فیها الشحنات فقط عن
                  طریق البر ، عندما تنطبق الحدود الواردة أدناه. ً ، فإن مسئولیة
                  SLD EXPRESS تعتبر أو ستعتبر مقیدة بموجب اتفاقیة النقل الدولي
                  فیما یتعلق بالشحنات العابرة للحدود المنقولة برا للبضائع عن
                  طریق البر (CMR (بأقل من (1 (القیمة السوقیة الحالیة أو القیمة
                  المعلنة ، أو (2 (33.8 حقوق السحب الخاصة لكل كیلوغرام (حوالي
                  00.14 ً دولارا أمریكیً ً ا للكیلوغرام الواحد). تنطبق هذه
                  الحدود أیضا على النقل البري الوطني في حالة عدم وجود حدود
                  إلزامیة أو حدود أدنى للمسؤولیة في قانون النقل الوطني المعمول
                  به. إذا اعتبر ناقل الشحنة هذه الحدود غیر كافیة ، فیجب علیها
                  إصدار إعلان خاص بالقیمة وطلب التأمین على النحو الموصوف في
                  القسم 8 أو اتخاذ ترتیبات التأمین الخاصة بها. تقتصر مسؤولیة SLD
                  EXPRESS بشكل صارم على الخسارة المباشرة والأضرار التي لحقت
                  بالشحنة فقط وحدود الكیلوغرام في هذا القسم 6 .یتم استبعاد جمیع
                  أنواع الخسائر أو الأضرار الأخرى (بما في ذلك على سبیل المثال لا
                  الحصر الأرباح المفقودة ً أو الدخل أو الفائدة أو الأعمال
                  المستقبلیة) ، سواء كانت هذه الخسارة أو الضرر خاصا أو غیر مباشر
                  ، وحتى إذا تم عرض خطر هذه الخسارة أو الضرر على SLD EXPRESS 2
                  .ستبذل SLD EXPRESS كل جهد ممكن لتسلیم الشحنة وفقًا لجداول
                  التسلیم المنتظمة لـ SLD EXPRESS ، لكن هذه الجداول الزمنیة لیست
                  ً ملزمة ولا تشكل جزءا من العقد. لا تتحمل SLD EXPRESS أي
                  مسؤولیة عن أي أضرار أو خسائر ناجمة عن التأخیر ، ولكن بالنسبة
                  لشحنات معینة ، قد یتمكن الشاحن من المطالبة بالتعویض المحدود عن
                  التأخیر بموجب شروط وأحكام ضمان رد الأموال. 10- المطالبات یجب
                  تقدیم جمیع المطالبات كتابیًا إلى SLD EXPRESS في غضون ثلاثین
                  (30 ( ً یوما من تاریخ قبول SLD EXPRESS للشحن ، إذا لم تتحمل
                  SLD EXPRESS أیة مسؤولیة على الإطلاق. تقتصر المطالبات على
                  مطالبة واحدة لكل شحنة ، والتي ستكون التسویة كاملة ونهائیة
                  لجمیع الخسائر أو الأضرار المتعلقة بها. 11- تأمین الشحن قد
                  تتمكن SLD EXPRESS من ترتیب تأمین یغطي القیمة فیما یتعلق بفقدان
                  الشحنة أو تلفها ، شریطة أن یرسل الشاحن ذلك إلى SLD EXPRESS
                  كتابیًا ، بما في ذلك عن طریق إكمال قسم التأمین في مقدمة بولیصة
                  الشحن أو عن طریق أنظمة SLD EXPRESS الآلیة ویدفع القسط المطبق.
                  لا یغطي تأمین الشحن الخسارة أو الضرر غیر المباشر ، أو الخسارة
                  أو الضرر الناجم عن التأخیرات. 12- الظروف الخارجة عن سیطرة SLD
                  EXPRESS SLD EXPRESS غیر مسؤول عن أي خسارة أو ضرر ینشأ عن ظروف
                  خارجة عن سیطرة SLD EXPRESS. وتشمل هذه على سبیل المثال لا الحصر
                  الأضرار الكهربائیة أو المغناطیسیة للصور أو البیانات أو
                  التسجیلات الإلكترونیة أو الفوتوغرافیة أو محوها ؛ أي عیب أو
                  خاصیة تتعلق بطبیعة الشحنة ، حتى لو كانت معروفة لدى SLD EXPRESS
                  ؛ أي فعل أو إهمال من قبل شخص لا یعمل أو یتعاقد معه SLD EXPRESS
                  - على سبیل المثال الشاحن أو المتلقي أو الطرف الثالث أو الجمارك
                  أو أي مسؤول حكومي آخر ؛ "القوة القاهرة" - على سبیل المثال
                  زلزال ، إعصار ، عاصفة ، فیضان ، ضباب ، حرب ، تحطم طائرة ، حظر
                  ، أعمال شغب ، ضجة مدنیة ، أو عمل صناعي. 13- ضمانات ناقل الشحنة
                  والتعویضات یجب على ناقل الشحنة تعویض ومحاسبة SLD EXPRESS عن أي
                  خسارة أو ضرر ناتج عن فشل الشاحن في الامتثال للضمانات والبیانات
                  التالیة: 1 .جمیع المعلومات التي تقدمها شركة ناقل الشحنة أو
                  ممثلیها كاملة ودقیقة ؛ 2 .الشحنة مقبولة للنقل بموجب القسم 2
                  أعلاه ؛ 3 .تم تحضیر الشحنة في أماكن آمنة بواسطة أشخاص موثوق
                  بهم وتمت حمایتها من أي تدخل غیر مصرح به أثناء الإعداد والتخزین
                  وأي نقل إلى SLD EXPRESS ؛ 4 - امتثال ناقل الشحنة لجمیع
                  القوانین المعمول بها في الجمارك والاستیراد والتصدیر وحمایة
                  البیانات والعقوبات والحظر وغیرها من القوانین واللوائح ؛ 5 .حصل
                  ناقل الشحنة على جمیع الموافقات اللازمة فیما یتعلق بالبیانات
                  الشخصیة المقدمة إلى SLD EXPRESS بما في ذلك بیانات المستلم التي
                  قد تكون مطلوبة للنقل والتخلیص الجمركي والتسلیم ، مثل عنوان
                  البرید الإلكتروني ورقم الهاتف المحمول. 14- التوجیه یوافق ناقل
                  الشحنة على جمیع عملیات التوجیه والتحویل ، بما في ذلك إمكانیة
                  نقل الشحنة عبر أماكن التوقف المتوسطة. 15- القوانین الناظمة
                  یخضع أي نزاع ینشأ بموجب هذه الشروط والأحكام أو یرتبط بها بأي
                  طریقة ، لصالح SLD EXPRESS ، للاختصاص القضائي غیر الحصري لمحاكم
                  ، ویحكمها قانون بلد منشأ الشحنة وناقل الشحنة. یقدم بشكل لا
                  رجعة فیه إلى هذه الولایة القضائیة ، ما لم یتعارض مع القانون
                  المعمول به. 16- قابلیة الفصل لا یؤثر بطلان أو عدم إمكانیة
                  تنفیذ أي بند على أي جزء آخر من هذه الشروط والأحكام. 17-
                  التطبیق تسري هذه الشروط والأحكام على وSLD EXPRESS لصالح SLD
                  EXPRESS ووكلائها المعتمدین والشركات التابعة لها ومكتبهم
                  ومدیریهم وموظفیهم. 19- حقوق المستفید والالتزامات أ. یجب على
                  المستفید قراءة وقبول شروط وأحكام الخدمة والعقد وآلیة الدفع
                  والاسترداد قبل الموافقة على تنفیذ الطلب. یجب أن یدفع المستفید
                  لمزود الخدمة كما هو متفق علیه في عقد الخدمة. ج. المستفید هو
                  المسؤول عن صحة المعلومات والبیانات التي یدخلها المستفید. د.
                  یضمن صاحب الشحنة أن كل مادة في الشحنة الموصوفة بشكل صحیح في
                  بولیصة الشحن الجوي هذه لم تعلن من قبل SLD EXPRESS غیر مقبولة
                  للنقل وأن الشحنة قد تم وضع علامة علیها ومعالجتها وتعبئتها بشكل
                  صحیح لضمان النقل الآمن مع عنایة عادیة. ه. یتعهد صاحب الشحنة
                  بالامتثال لجمیع القوانین واللوائح في المملكة العربیة السعودیة
                  ، من وإلى أو من خلال أو التي تمر علیها الشحنة. و. یؤكد صاحب
                  الشحنة أن جمیع المعلومات المقدمة إلى SLD EXPRESS أو المنصوص
                  علیها في بولیصة الشحن SLD EXPRESS هذه دقیقة وكاملة. ز. یوافق
                  صاحب الشحنة على تعویض SLD EXPRESS على أي مطالبة أو مسؤولیة أو
                  مصاریف تنشأ عن فشل صاحب الشحنة في الامتثال لأي قانون أو لوائح
                  معمول بها. ح. للمستفید الحق في الخدمات مقابل الأسعار المعلنة
                  دون أي زیادة. ج. یجب على المستفید التحقق من الشحنة قبل توقیع
                  مذكرة التسلیم. ي. یجب على أي مستفید لم یتم تسلیمه الشحنة أو لم
                  یتم العثور علیها أن یخطر مقدم الخدمة من خلال إحدى قنوات
                  الاتصال المعتمدة. ك. یحق لـ SLD EXPRESS تغییر وتعدیل وإلغاء
                  وإضافة الشروط والأحكام المتعلقة بخدمة SLD EXPRESS المذكورة هنا
                  دون سابق إنذار. ل. تلتزم SLD EXPRESS بالشروط والأحكام الساریة
                  في تاریخ توقیع عقد الخدمة.
                </p>
              </Grid>
              <Grid item xs={12}>
                <Button
                  onClick={() => {
                    dispatch(
                      transferWithDraw(
                        {
                          signature: signSignature.current
                            .getTrimmedCanvas()
                            .toDataURL('image/png'),
                          quantity: withdrawWarehouse.quantity,
                          withdraw_date_time:
                            withdrawWarehouse.withdraw_date_time.date +
                            ' ' +
                            withdrawWarehouse.withdraw_date_time.time,
                          order_id: withdrawWarehouse.order_id,
                        },
                        customer.id,
                        setWithdrawModal,
                        setOpenTearmentModal
                      )
                    );
                  }}
                  type='submit'
                  variant='contained'
                >
                  {t('done')}
                </Button>
              </Grid>
            </Grid>
          </ModalContent>
        </ModalContainer>
      </Modal>
      <ContentWrap>
        <SideBar />
        <InnerConatiner>
          <div className='container p-md-5 '>
            <div className='row'>
              <div className='col-12'>
                <Header>{t('orderList')}</Header>
                <TableContainer component={Paper}>
                  <Table sx={{ minWidth: 450 }} aria-label='simple table'>
                    <TableHead>
                      <TableRow>
                        <TableCell width={50}>#</TableCell>
                        <TableCell width={50}>{t('productName')}</TableCell>
                        <TableCell width={50}>{t('img')}</TableCell>
                        <TableCell width={50}>{t('shelfNumber')}</TableCell>
                        <TableCell width={50}>{t('storageType')}</TableCell>
                        <TableCell width={50}>{t('quantity')}</TableCell>
                        <TableCell width={50}>{t('customerName')}</TableCell>
                        <TableCell width={50}>{t('totalprice')}</TableCell>
                        <TableCell width={50}>{t('Pay')}</TableCell>
                        <TableCell width={50}>{t('barcode')}</TableCell>
                        <TableCell width={50}>{t('createdAt')}</TableCell>
                        <TableCell width={50}>{t('ExpiryDate')}</TableCell>
                        <TableCell width={50}>{t('checkedInTime')}</TableCell>
                        <TableCell width={50}>{t('checkOutTime')}</TableCell>
                        <TableCell align='center' width={50}>
                          {t('action')}
                        </TableCell>
                      </TableRow>
                    </TableHead>
                    <TableBody>
                      {orderList !== undefined &&
                        orderList.map((shelf, index) => (
                          <TableRow
                            key={index}
                            sx={{
                              '&:last-child td, &:last-child th': { border: 0 },
                            }}
                          >
                            <TableCell component='th' scope='row'>
                              {index + 1}
                            </TableCell>
                            <TableCell>{shelf.product_name}</TableCell>
                            <TableCell>
                              <img
                                src={
                                  'https://wmsss.herokuapp.com/' + shelf.image
                                }
                                alt='product'
                                width='150px'
                              />
                            </TableCell>
                            <TableCell>{shelf.shelf_number}</TableCell>
                            <TableCell>{shelf.storage_type}</TableCell>
                            <TableCell>{shelf.quantity}</TableCell>
                            <TableCell>{customer.name}</TableCell>
                            <TableCell>{shelf.total_price}</TableCell>
                            <TableCell>
                              {shelf.paid === 1 ? 'Paid' : 'UnPaid'}
                            </TableCell>
                            <TableCell>{shelf.barcode}</TableCell>
                            <TableCell>
                              {formatDateAndTimeString(
                                new Date(shelf.created_at)
                              )}
                            </TableCell>
                            <TableCell>
                              {formatDateAndTimeString(
                                new Date(shelf.expiry_date)
                              )}
                            </TableCell>
                            <TableCell>
                              {formatDateAndTimeString(
                                new Date(shelf.checkin_time)
                              )}
                            </TableCell>
                            <TableCell>
                              {formatDateAndTimeString(
                                new Date(shelf.checkout_time)
                              )}
                            </TableCell>
                            <TableCell align='center'>
                              <IconButton
                                onClick={() => {
                                  setTransferWarehouse({
                                    ...transferWarehouse,
                                    order_id: shelf.id,
                                  });
                                  setTransferModal(true);
                                }}
                              >
                                <TransferWithinAStationIcon />
                              </IconButton>
                              {shelf.quantity > 0 && (
                                <IconButton
                                  onClick={() => {
                                    setWithdrawWarehouse({
                                      ...withdrawWarehouse,
                                      order_id: shelf.id,
                                      tempQuantity: shelf.quantity,
                                    });
                                    console.log(shelf.quantity);
                                    setWithdrawModal(true);
                                  }}
                                >
                                  <UndoIcon />
                                </IconButton>
                              )}
                            </TableCell>
                          </TableRow>
                        ))}
                    </TableBody>
                  </Table>
                </TableContainer>
              </div>
            </div>
          </div>
        </InnerConatiner>
      </ContentWrap>
    </Container>
  );
};

export default OrderList;
